{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Alcohol Ether",
    "1": "Atomic Structure",
    "2": "Biomolecules",
    "3": "Chemical Bonding",
    "4": "Chemical Equilibrium",
    "5": "Coordination Chemistry",
    "6": "Environmental Chemistry",
    "7": "Hydrocarbon",
    "8": "Hydrogen and its compounds",
    "9": "Metallurgy",
    "10": "Mole concept",
    "11": "p-block",
    "12": "PERIODIC TABLE",
    "13": "POLYMERS",
    "14": "REDOX EQUIVALENT",
    "15": "S-BLOCK ELEMENTS",
    "16": "Solid State",
    "17": "States of Matter",
    "18": "Surface Chemistry",
    "19": "Thermodynamics",
    "20": "Application of Derivative (AOD)",
    "21": "Binomial Theorem",
    "22": "Circle",
    "23": "Compound Angle",
    "24": "CONTINUITY",
    "25": "DIFFERENTIABILITY",
    "26": "Differential Equation",
    "27": "Ellipse",
    "28": "Functions",
    "29": "Hyperbola",
    "30": "Indefinite Integration",
    "31": "Limit",
    "32": "Matrix",
    "33": "Methods of Differentiation",
    "34": "Permutation, Combination",
    "35": "Probability",
    "36": "Quadratic Equation",
    "37": "Sequence & Series",
    "38": "Solution of Triangle",
    "39": "Straight Line",
    "40": "Trigonometric Equation",
    "41": "Vector",
    "42": "ALTERNATING CURRENT",
    "43": "Capacitance",
    "44": "Centre of Mass, Momentum & Collision",
    "45": "Circular Motion",
    "46": "Current Electricity",
    "47": "Electrostatics",
    "48": "EMI",
    "49": "KTG and Thermodynamics",
    "50": "Magnetic Effect of Current",
    "51": "Modern Physics 2",
    "52": "Modern Physics-1",
    "53": "NEWTON\u2019S LAWS OF MOTION",
    "54": "SHM",
    "55": "Sound Wave",
    "56": "Wave Optics"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ALTERNATING CURRENT": 42,
    "Alcohol Ether": 0,
    "Application of Derivative (AOD)": 20,
    "Atomic Structure": 1,
    "Binomial Theorem": 21,
    "Biomolecules": 2,
    "CONTINUITY": 24,
    "Capacitance": 43,
    "Centre of Mass, Momentum & Collision": 44,
    "Chemical Bonding": 3,
    "Chemical Equilibrium": 4,
    "Circle": 22,
    "Circular Motion": 45,
    "Compound Angle": 23,
    "Coordination Chemistry": 5,
    "Current Electricity": 46,
    "DIFFERENTIABILITY": 25,
    "Differential Equation": 26,
    "EMI": 48,
    "Electrostatics": 47,
    "Ellipse": 27,
    "Environmental Chemistry": 6,
    "Functions": 28,
    "Hydrocarbon": 7,
    "Hydrogen and its compounds": 8,
    "Hyperbola": 29,
    "Indefinite Integration": 30,
    "KTG and Thermodynamics": 49,
    "Limit": 31,
    "Magnetic Effect of Current": 50,
    "Matrix": 32,
    "Metallurgy": 9,
    "Methods of Differentiation": 33,
    "Modern Physics 2": 51,
    "Modern Physics-1": 52,
    "Mole concept": 10,
    "NEWTON\u2019S LAWS OF MOTION": 53,
    "PERIODIC TABLE": 12,
    "POLYMERS": 13,
    "Permutation, Combination": 34,
    "Probability": 35,
    "Quadratic Equation": 36,
    "REDOX EQUIVALENT": 14,
    "S-BLOCK ELEMENTS": 15,
    "SHM": 54,
    "Sequence & Series": 37,
    "Solid State": 16,
    "Solution of Triangle": 38,
    "Sound Wave": 55,
    "States of Matter": 17,
    "Straight Line": 39,
    "Surface Chemistry": 18,
    "Thermodynamics": 19,
    "Trigonometric Equation": 40,
    "Vector": 41,
    "Wave Optics": 56,
    "p-block": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
